STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_p2pClient_Ext/STM32_WPAN/App/app_ble.c
    if( !(HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010)) && /* extended */
        (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0001)) )   /* connectable */
    {
      uint8_t i, adtype, adlength;
      
      i = 0;
      while ( i < p_ext_adv_report->Data_Length )
      {
        adlength = p_ext_adv_report->Data[i];
        adtype = p_ext_adv_report->Data[i + 1];
        
        if ( adtype == AD_TYPE_MANUFACTURER_SPECIFIC_DATA )
        {
          if ( (adlength >= 7) && 
               (p_ext_adv_report->Data[i + 4] == 0x02) && /* blueST v2*/
               (p_ext_adv_report->Data[i + 6] == 0x83))   /* p2pServer application */
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "p2pServer detected, address recorded to connect. | ");

            bleAppContext.a_deviceServerExtendedBdAddr[0] = p_ext_adv_report->Address[0];
            bleAppContext.a_deviceServerExtendedBdAddr[1] = p_ext_adv_report->Address[1];
            bleAppContext.a_deviceServerExtendedBdAddr[2] = p_ext_adv_report->Address[2];
            bleAppContext.a_deviceServerExtendedBdAddr[3] = p_ext_adv_report->Address[3];
            bleAppContext.a_deviceServerExtendedBdAddr[4] = p_ext_adv_report->Address[4];
            bleAppContext.a_deviceServerExtendedBdAddr[5] = p_ext_adv_report->Address[5];
            bleAppContext.deviceServerExtendedAddressType = p_ext_adv_report->Address_Type;

            bleAppContext.deviceServerFound = 0x01;
          }
        }
        i += adlength + 1;
      }
    }

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "\n");
   
    LOG_INFO_APP("%s",l_buff);
  }
    
  return status;
}

static void connectRequestExt(void)
{
  tBleStatus result;

  if (bleAppContext.deviceServerFound != 0x00)
  {
    LOG_INFO_APP("aci_gap_create_connection\n");
    result = aci_gap_create_connection(SCAN_INT_MS(500), SCAN_WIN_MS(500),
                                       bleAppContext.deviceServerExtendedAddressType, 
                                       &bleAppContext.a_deviceServerExtendedBdAddr[0],
                                       CFG_BD_ADDRESS_TYPE,
                                       CONN_INT_MS(50), CONN_INT_MS(100),
                                       0,
                                       CONN_SUP_TIMEOUT_MS(5000),
                                       CONN_CE_LENGTH_MS(10), CONN_CE_LENGTH_MS(10));

    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
    }
    else
    {
      LOG_INFO_APP("==>> GAP Create connection Failed , result: 0x%02x\n", result);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }

  return;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

void NVMCB_Store( const uint32_t* ptr, uint32_t size )
{
  UNUSED(ptr);
  UNUSED(size);

  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APP_BSP_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    if (scan_running == 1)
    {
      APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_TERMINATE);
      scan_running = 0;
    }
    else
    {
      APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
      scan_running = 1;
    }
  }
  else
  {
    UTIL_SEQ_SetTask( 1u << CFG_TASK_P2PC_WRITE_CHAR_ID, CFG_SEQ_PRIO_0);
  }

  return;
}

void APP_BSP_Button2Action(void)
{
  display_filter = !display_filter;

  return;
}

void APP_BSP_Button3Action(void)
{
  if(bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    UTIL_SEQ_SetTask(1u << CFG_TASK_CONN_REQ_EXT_DEV_ID, CFG_SEQ_PRIO_0);
  }
  else
  {
    LOG_INFO_APP("==>> Device already connected\n");
  }

  return;
}
#endif
/* USER CODE END FD_WRAP_FUNCTIONS */
